### 4. 테이터프레임 테이터 조작

In [25]:
import pandas as  pd
import numpy as np

- 데이터 갯수 세기

In [26]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [27]:
df.count()           # 열(위,가로) 기준 숫자 개수 카운트 해줌것임

0    4
1    4
2    4
3    3
dtype: int64

In [28]:
import seaborn as sns
titanic =sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [29]:
#columm별로 데이터의 갯수,평균,표준편차,최소/최대 등의 정보를 보여줌
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- 연습 문제 4.4.1
    - 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [30]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [31]:
# 열 별로 센다
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [32]:
titanic['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

- 정렬

In [33]:
np.random.seed = 2023
df = pd.DataFrame(np.random.randint(40,101,size=(4,5)),
                  index=list('abcd'),columns=list('VWXYZ'))
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [34]:
df.sort_values(by='V',ascending=False)

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [35]:
#V열에 동일한 값이 있으면,동일한 값은 W 열을 보고 정렬
df2=df.sort_values(by=['V','W'],ascending=False)
df2

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [36]:
df2.sort_index()

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

- 연습 문제 4.4.2
    - sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [37]:
print(titanic['sex'].value_counts())
print(titanic['class'].value_counts())
print(titanic['alive'].value_counts())

sex
male      577
female    314
Name: count, dtype: int64
class
Third     491
First     216
Second    184
Name: count, dtype: int64
alive
no     549
yes    342
Name: count, dtype: int64

- 행/열 합계

In [38]:
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [39]:
# 행 방향(열의 합계)
df.sum(axis=0)

V    279
W    330
X    336
Y    209
Z    254
dtype: int64

In [40]:
# 열 방향 (해의 합계)
df.sum(axis=1)

a    413
b    359
c    311
d    325
dtype: int64

In [41]:
#총접 열 만들기
df['총점'] =df.sum(axis=1)
df

    V   W    X   Y   Z   총점
a  83  91   79  78  82  413
b  73  98  100  43  45  359
c  64  44   86  46  71  311
d  59  97   71  42  56  325

In [42]:
#평균 열만들기
df['평균']= df[['V','W','X','Y','Z']].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균
a  83  91   79  78  82  413  82.6
b  73  98  100  43  45  359  71.8
c  64  44   86  46  71  311  62.2
d  59  97   71  42  56  325  65.0

In [43]:
df['평균2'] = df.iloc[:,:5].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균   평균2
a  83  91   79  78  82  413  82.6  82.6
b  73  98  100  43  45  359  71.8  71.8
c  64  44   86  46  71  311  62.2  62.2
d  59  97   71  42  56  325  65.0  65.0

In [44]:
# 행 추가 방법
df.loc['합계',:] = df.sum()
df

        V      W      X      Y      Z      총점     평균    평균2
a    83.0   91.0   79.0   78.0   82.0   413.0   82.6   82.6
b    73.0   98.0  100.0   43.0   45.0   359.0   71.8   71.8
c    64.0   44.0   86.0   46.0   71.0   311.0   62.2   62.2
d    59.0   97.0   71.0   42.0   56.0   325.0   65.0   65.0
합계  279.0  330.0  336.0  209.0  254.0  1408.0  281.6  281.6

- 연습 문제 4.4.3

In [45]:
import seaborn as sns
titanic =sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [46]:
# 타이타닉호 승객의 평균 나이를 구하라.
titanic['age'].mean()

29.69911764705882

In [47]:
#타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
ft =titanic[titanic.sex == 'female']
ft.head(3)
ft.age.mean().round(2)

27.92

In [48]:
titanic[titanic.sex == 'female'].age.mean().round(2)

27.92

In [49]:
#타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
titanic[(titanic.pclass == 1)& (titanic.sex == 'female')]['age'].mean().round(2)

34.61

- apply 변환

In [50]:
titanic.apply(lambda x: x.count())

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [51]:
df2

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [52]:
df2.describe()

               V          W           X          Y          Z
count   4.000000   4.000000    4.000000   4.000000   4.000000
mean   69.750000  82.500000   84.000000  52.250000  63.500000
std    10.563301  25.852144   12.301761  17.250604  16.299284
min    59.000000  44.000000   71.000000  42.000000  45.000000
25%    62.750000  79.250000   77.000000  42.750000  53.250000
50%    68.500000  94.000000   82.500000  44.500000  63.500000
75%    75.500000  97.250000   89.500000  54.000000  73.750000
max    83.000000  98.000000  100.000000  78.000000  82.000000

In [53]:
# 각 열에서 최대값 - 최소값 한 결과 👀(x = 열을 의미함)
df2.apply(lambda x: x.max() - x.min())              # x는 각  colum(열)을 의미

V    24
W    54
X    29
Y    36
Z    37
dtype: int32

In [54]:
# V 열의 제곱수 
df.V.apply(lambda x: x * x )         # x는 한컬럼의 원소를 의미

a      6889.0
b      5329.0
c      4096.0
d      3481.0
합계    77841.0
Name: V, dtype: float64

In [55]:
#  타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열
titanic['adult/child'] = titanic.age.apply(lambda x: 'adult' if x > 20 else 'child')
titanic.tail(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [56]:
data = {
    'price':['1,200','2,500','3,300'],
    'text':['03.입출력.ipynb','04.고급인덱싱.ipynb','05.데이터의 조작.ipynb']
    }
df3 =pd.DataFrame(data)
df3

   price              text
0  1,200      03.입출력.ipynb
1  2,500    04.고급인덱싱.ipynb
2  3,300  05.데이터의 조작.ipynb

In [57]:
int('1,200'.replace(',',''))

1200

In [58]:
df3['정수']=df3.price.apply(lambda x: int(x.replace(',','')))
df3

   price              text    정수
0  1,200      03.입출력.ipynb  1200
1  2,500    04.고급인덱싱.ipynb  2500
2  3,300  05.데이터의 조작.ipynb  3300

In [59]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.',''))
df3

   price              text    정수           구둣점제거
0  1,200      03.입출력.ipynb  1200      03입출력ipynb
1  2,500    04.고급인덱싱.ipynb  2500    04고급인덱싱ipynb
2  3,300  05.데이터의 조작.ipynb  3300  05데이터의 조작ipynb

In [60]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.',''))
df3

   price              text    정수           구둣점제거
0  1,200      03.입출력.ipynb  1200      03입출력ipynb
1  2,500    04.고급인덱싱.ipynb  2500    04고급인덱싱ipynb
2  3,300  05.데이터의 조작.ipynb  3300  05데이터의 조작ipynb

In [61]:
import re

def remove_korean(text):
    korean_pattern = re.compile('[ㄱ-ㅎㅏ-ㅣ가-힣]+')
    return korean_pattern.sub('', text)

df3['한글제거'] = df3.구둣점제거.apply(remove_korean)
df3

   price              text    정수           구둣점제거      한글제거
0  1,200      03.입출력.ipynb  1200      03입출력ipynb   03ipynb
1  2,500    04.고급인덱싱.ipynb  2500    04고급인덱싱ipynb   04ipynb
2  3,300  05.데이터의 조작.ipynb  3300  05데이터의 조작ipynb  05 ipynb

In [ ]:
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else 'child', axis=1)
titanic['category1']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887     child
888     child
889      male
890      male
Name: category1, Length: 891, dtype: object